package homework3;
/*
1. За допомогою циклу for вивести на екран непарні числа від 1 до 99.
2. Дано число n за допомогою циклу for порахувати факторіал n!
3. Перепишіть програми 1 та 2 за допомогою циклу while.
4. Перепишіть програми 1 та 2 із використанням циклу do - while.
5. Дано змінні x і n обчислити x^n.
6. Вивести 10 перших чисел послідовності 0, -5,-10,-15.
7. Необхідно вивести на екран таблицю множення на Х: (будь-яке число, що вводиться з консолі)
8. Створіть масив, що містить 10 перших непарних чисел. Виведіть елементи масиву на консоль в один рядок, розділяючи комою.
9.Даний масив розмірності N, знайти найменший елемент масиву і вивести на консоль
10. У масиві із завдання 9. Визначити найбільший елемент.
11. Поміняти максимальний і найменший елементи масиву місцями. Приклад: дано масив {4, -5, 0, 6, 8}. Після заміни виглядатиме {4, 8, 0, 6, -5}.

 */
public class MyClass {
    public static void main(String[] args) {


    }
}
