package homework2;

/*
Програму, яка пропонує користувачеві запровадити суму грошового вкладу у гривнях,
відсоток річних, які виплачує банк, тривалість вкладу (років). Вивести накопичену
суму грошей за кожен рік та нараховані відсотки. (Відсотки складні з капіталізацією щомісяця)

У завданні 3 числа вводити через аргументи програми

приклад

java DepositCalculator <сума> <відсоток> <тривалість_у_роках>
 */
public class Vklad {
    public static void main(String[] args) {
        System.out.println("Hello World");
    }
}
